xucenying/tinyml-anomaly-psoc-c3m5/firmware/main.cpp
/*
 * main.cpp — CWRU bearing-fault classifier on PSOC Control C3M5 (KIT_PSC3M5_EVK)
 * INT8 MLP (128 FFT features -> 96 -> 48 -> 10 classes), TFLite-Micro.
 * Runs 10 embedded validation vectors (one per class) and reports
 * prediction, confidence, and DWT cycle count per inference. Apache-2.0.
 */
#include "cy_pdl.h"
#include "cybsp.h"
#include "cy_retarget_io.h"
#include "mtb_hal.h"

#include <cstdio>

#include "tensorflow/lite/micro/micro_interpreter.h"
#include "tensorflow/lite/micro/micro_mutable_op_resolver.h"
#include "tensorflow/lite/schema/schema_generated.h"

/* Pick ONE: model_data.h (INT8, 24 KB) or model_data_fp32.h (FP32, 72 KB) */
//#include "model_data_fp32.h"
#include "model_data.h"
#include "test_vectors.h"      /* 10 validation feature vectors */

/* INFERENCE_ONLY=1: pure-inference ladder — NO on-board FFT. Feeds the
   pre-windowed features in test_vectors.h so FP32 / INT8 / INT8+CMSIS-NN can be
   compared on model size, arena, and inference cycles alone.
   Set to 0 to restore the full on-board-FFT + live-replay demo. */
#define INFERENCE_ONLY 0

#if !INFERENCE_ONLY
#include "fft_selftest.h"
#include "replay_protocol.h"   /* PC<->board streaming wire format */
#endif

#include <cstring>

/* ---- class table (id -> label); "normal" is the healthy class ---- */
static const char *const kClassLabels[10] = {
    "b_007", "b_014", "b_021", "ir_007", "ir_014", "ir_021",
    "normal", "or_007", "or_014", "or_021"};
static constexpr int kNormalClass = 6;

/* ---- alert-logic tuning (see run_replay) ---- */
static constexpr int kConfThreshPct = 60;  /* min confidence to trust a call     */
static constexpr int kDebounceFault = 3;   /* consecutive faults to latch ALERT  */
static constexpr int kDebounceClear = 5;   /* consecutive normals to clear ALERT */

static cy_stc_scb_uart_context_t DEBUG_UART_context;
static mtb_hal_uart_t            DEBUG_UART_hal_obj;

constexpr int kTensorArenaSize = 16 * 1024;
alignas(16) static uint8_t tensor_arena[kTensorArenaSize];

/* --- minimal DWT cycle counter (full harness lands in step 1.9) --- */
static inline void dwt_init(void) {
    CoreDebug->DEMCR |= CoreDebug_DEMCR_TRCENA_Msk;
    DWT->CYCCNT = 0;
    DWT->CTRL |= DWT_CTRL_CYCCNTENA_Msk;
}
static inline uint32_t dwt_now(void) { return DWT->CYCCNT; }

static void halt(const char *msg) { printf("FATAL: %s\r\n", msg); for (;;) {} }

/* --- board LED: on = fault latched (guarded so it compiles on any BSP) --- */
static inline void led_set(bool on) {
#if defined(CYBSP_USER_LED_PORT) && defined(CYBSP_USER_LED_PIN)
  #if defined(CYBSP_LED_STATE_ON)
    Cy_GPIO_Write(CYBSP_USER_LED_PORT, CYBSP_USER_LED_PIN,
                  on ? CYBSP_LED_STATE_ON : CYBSP_LED_STATE_OFF);
  #else
    Cy_GPIO_Write(CYBSP_USER_LED_PORT, CYBSP_USER_LED_PIN, on ? 0u : 1u);
  #endif
#else
    (void)on;   /* no user LED on this BSP — status still goes out over UART */
#endif
}

#if !INFERENCE_ONLY
/* --- blocking single-byte UART read (shares the retarget-io SCB) --- */
static inline uint8_t uart_get_byte(void) {
    uint32_t b;
    do { b = Cy_SCB_UART_Get(DEBUG_UART_HW); } while (b == CY_SCB_UART_RX_NO_DATA);
    return (uint8_t)b;
}

/* Read one chunk frame: RPL_HOP int16 ADC counts -> hop[RPL_HOP] as float.
 * Returns true on a CRC-valid chunk, false on desync/CRC mismatch. */
static bool read_chunk(float *hop) {
    static int16_t buf16[RPL_HOP];              /* 1024 bytes staging (12-bit ADC) */
    /* hunt for SYNC0 SYNC1 */
    for (;;) {
        if (uart_get_byte() != RPL_SYNC0) continue;
        if (uart_get_byte() == RPL_SYNC1) break;
    }
    uint16_t len = (uint16_t)uart_get_byte();
    len |= (uint16_t)uart_get_byte() << 8;
    if (len != RPL_PAYLOAD_LEN) return false;   /* desync; resync on next call */

    uint8_t *raw = (uint8_t *)buf16;            /* 1024 bytes, LE int16 in place */
    for (uint16_t i = 0; i < RPL_PAYLOAD_LEN; ++i) raw[i] = uart_get_byte();

    uint16_t crc = (uint16_t)uart_get_byte();
    crc |= (uint16_t)uart_get_byte() << 8;
    if (crc != rpl_crc16(raw, RPL_PAYLOAD_LEN)) return false;

    for (int i = 0; i < RPL_HOP; ++i) hop[i] = (float)buf16[i];   /* counts -> float */
    return true;
}

/* Continuous ADC stream: read HOP-sample chunks, slide a 1024-sample window
 * (hop = RPL_HOP), and on every FULL window run on-board FFT -> INT8 classify ->
 * debounced alert. Prints "WARM" until the first window is full. Never returns.
 * This is exactly how a live ADC+DMA feed would drive the pipeline. */
static void run_stream(tflite::MicroInterpreter &interpreter,
                       TfLiteTensor *in, TfLiteTensor *out,
                       float in_scale, int in_zp,
                       float out_scale, int out_zp) {
    static float ring[RPL_RAW_DIM];       /* sliding 1024-sample window */
    static float hop[RPL_HOP];            /* newest chunk               */
    static float feat[FE_NBINS];          /* 128 FFT features           */
    uint32_t seq = 0;
    int fault_run = 0, normal_run = 0, filled = 0;
    bool alert = false;

    fe_init();   /* Hann table + FFT instance once */

    printf("\r\n=== ADC stream: %d-sample chunks -> sliding %d-window -> FFT -> classify ===\r\n",
           RPL_HOP, RPL_RAW_DIM);
    led_set(false);

    for (;;) {
        if (!read_chunk(hop)) { printf("ERR crc\r\n"); continue; }

        /* slide the window: drop oldest HOP, append newest HOP */
        for (int i = 0; i < RPL_RAW_DIM - RPL_HOP; ++i) ring[i] = ring[i + RPL_HOP];
        for (int i = 0; i < RPL_HOP; ++i) ring[RPL_RAW_DIM - RPL_HOP + i] = hop[i];

        if (filled < RPL_RAW_DIM) filled += RPL_HOP;
        if (filled < RPL_RAW_DIM) { printf("WARM\r\n"); continue; }  /* window not full yet */

        /* full window -> 128 features (on-board FFT, timed) */
        uint32_t f0 = dwt_now();
        fe_extract(ring, feat);
        uint32_t fft_dt = dwt_now() - f0;

        if (in->type == kTfLiteInt8) {
            for (int i = 0; i < FE_NBINS; ++i) {
                float q = feat[i] / in_scale + (float)in_zp;
                if (q > 127.0f) q = 127.0f; else if (q < -128.0f) q = -128.0f;
                in->data.int8[i] = (int8_t)q;
            }
        } else {
            for (int i = 0; i < FE_NBINS; ++i) in->data.f[i] = feat[i];
        }

        uint32_t t0 = dwt_now();
        if (interpreter.Invoke() != kTfLiteOk) halt("Invoke failed");
        uint32_t inf_dt = dwt_now() - t0;

        int best = 0;
        if (out->type == kTfLiteInt8) {
            for (int i = 1; i < 10; ++i)
                if (out->data.int8[i] > out->data.int8[best]) best = i;
        } else {
            for (int i = 1; i < 10; ++i)
                if (out->data.f[i] > out->data.f[best]) best = i;
        }
        int conf_pct = (out->type == kTfLiteInt8)
            ? (int)(((float)out->data.int8[best] - (float)out_zp) * out_scale * 100.0f)
            : (int)(out->data.f[best] * 100.0f);

        bool is_fault = (best != kNormalClass) && (conf_pct >= kConfThreshPct);
        if (is_fault) { fault_run++; normal_run = 0; }
        else          { normal_run++; fault_run = 0; }

        bool prev = alert;
        if (!alert && fault_run  >= kDebounceFault) alert = true;
        if ( alert && normal_run >= kDebounceClear) alert = false;
        if (alert != prev) {
            led_set(alert);
            if (alert) printf("*** ALERT: %s (%d%%) ***\r\n", kClassLabels[best], conf_pct);
        }

        printf("RES %lu %d %-7s %3d%% %lu %lu %s\r\n",
               (unsigned long)seq++, best, kClassLabels[best], conf_pct,
               (unsigned long)fft_dt, (unsigned long)inf_dt,
               alert ? "ALERT" : "ok");
    }
}
#endif /* !INFERENCE_ONLY */

int main(void)
{
    if (cybsp_init() != CY_RSLT_SUCCESS) { CY_ASSERT(0); }
    __enable_irq();

    if (Cy_SCB_UART_Init(DEBUG_UART_HW, &DEBUG_UART_config,
                         &DEBUG_UART_context) != CY_SCB_UART_SUCCESS) { CY_ASSERT(0); }
    Cy_SCB_UART_Enable(DEBUG_UART_HW);
    if (mtb_hal_uart_setup(&DEBUG_UART_hal_obj, &DEBUG_UART_hal_config,
                           &DEBUG_UART_context, NULL) != CY_RSLT_SUCCESS) { CY_ASSERT(0); }
    if (cy_retarget_io_init(&DEBUG_UART_hal_obj) != CY_RSLT_SUCCESS) { CY_ASSERT(0); }

    dwt_init();

    printf("\x1b[2J\x1b[;H");
    printf("=== CWRU bearing-fault classifier: PSOC Control C3M5 ===\r\n");
    printf("model: %u bytes\r\n", (unsigned)g_model_data_len);

    const tflite::Model *model = tflite::GetModel(g_model_data);
    if (model->version() != TFLITE_SCHEMA_VERSION) halt("schema mismatch");

    static tflite::MicroMutableOpResolver<2> resolver;
    resolver.AddFullyConnected();
    resolver.AddSoftmax();

    static tflite::MicroInterpreter interpreter(model, resolver,
                                                tensor_arena, kTensorArenaSize);
    if (interpreter.AllocateTensors() != kTfLiteOk) halt("AllocateTensors failed");
    printf("arena used: %u / %d bytes\r\n\r\n",
           (unsigned)interpreter.arena_used_bytes(), kTensorArenaSize);

    TfLiteTensor *in  = interpreter.input(0);
    TfLiteTensor *out = interpreter.output(0);
    const float in_scale  = in->params.scale;
    const int   in_zp     = in->params.zero_point;
    const float out_scale = out->params.scale;
    const int   out_zp    = out->params.zero_point;

#if !INFERENCE_ONLY
    /* on-board FFT feature extraction test (raw window -> FFT -> classify) */
    fft_selftest(interpreter, in, out);
#endif

#if INFERENCE_ONLY
    /* Feature-vector-only inference test (test_vectors.h, no on-board FFT).
     * Only meaningful in INFERENCE_ONLY mode, where fft_selftest() above did
     * NOT run - this is then the only source of inference timing. When
     * INFERENCE_ONLY=0, fft_selftest() already covers inference (as part of
     * the full raw-window pipeline), so this second, redundant test is
     * skipped entirely and compiled out. */
    int correct = 0;
    uint64_t total_cycles = 0;

    for (int t = 0; t < kNumTests; ++t) {
        /* feed input: quantize for INT8 models, copy for FP32 models */
        if (in->type == kTfLiteInt8) {
            for (int i = 0; i < kFeatureDim; ++i) {
                float q = kTestVectors[t][i] / in_scale + (float)in_zp;
                if (q > 127.0f) q = 127.0f;
                if (q < -128.0f) q = -128.0f;
                in->data.int8[i] = (int8_t)q;
            }
        } else {
            for (int i = 0; i < kFeatureDim; ++i)
                in->data.f[i] = kTestVectors[t][i];
        }

        uint32_t t0 = dwt_now();
        if (interpreter.Invoke() != kTfLiteOk) halt("Invoke failed");
        uint32_t dt = dwt_now() - t0;
        total_cycles += dt;

        int best = 0;
        if (out->type == kTfLiteInt8) {
            for (int i = 1; i < kNumTests; ++i)
                if (out->data.int8[i] > out->data.int8[best]) best = i;
        } else {
            for (int i = 1; i < kNumTests; ++i)
                if (out->data.f[i] > out->data.f[best]) best = i;
        }
        int conf_pct = (out->type == kTfLiteInt8)
            ? (int)(((float)out->data.int8[best] - (float)out_zp) * out_scale * 100.0f)
            : (int)(out->data.f[best] * 100.0f);
        bool ok = (best == kTestExpected[t]);
        correct += ok;

        printf("[%s] true=%-7s pred=%-7s conf=%3d%%  cycles=%lu (%lu us)\r\n",
               ok ? "PASS" : "FAIL", kTestLabels[t], kTestLabels[best], conf_pct,
               (unsigned long)dt, (unsigned long)(dt / 180));
    }

    printf("\r\n%d/%d correct, avg %lu cycles/inference (%lu us @180MHz)\r\n",
           correct, kNumTests,
           (unsigned long)(total_cycles / kNumTests),
           (unsigned long)(total_cycles / kNumTests / 180));
    printf("=== classifier test complete ===\r\n");
#endif /* INFERENCE_ONLY */

#if !INFERENCE_ONLY
    /* Hand off to continuous ADC stream: PC streams raw 12-bit samples in chunks,
     * board windows them, runs on-board FFT, classifies, debounced alert (LED+UART). */
    run_stream(interpreter, in, out, in_scale, in_zp, out_scale, out_zp);
#endif
    for (;;) { }        /* inference ladder: hold after the classifier test */
    return 0;
}
